package com.york.common.array;

/**
 * @author York.yuan
 * @version <1.0>
 * @description
 * @createdate 2019/6/20 11:49
 **/
public class MyArray {

    // 数组初始化的两种方式
    // 动态初始化
    // 数据类型[] 数组名称 = new 数据类型[长度] / 数据类型 数组名称[] = new 数据类型[长度](不推荐)
    // 静态初始化
    // 简化格式: 数据类型[] 数组名称 = {值, 值,…} / 数据类型 数组名称[] = {值, 值,…}(不推荐)
    // 完整格式: 数据类型[] 数组名称 = new 数据类型[] {值, 值,…} / 数据类型 数组名称[] = new 数据类型[] {值, 值,…}(不推荐)

    // 多维数组(一样分动态初始化和静态初始化)
    // 数据类型[][]... 数组名称 = new 数据类型[长度][长度]... / 数据类型 数组名称[][]... = new 数据类型[长度][长度]...
    // 数据类型[][]... 数组名称 = {{...}} / 数据类型 数组名称[][]...= {{...}}
    // 数据类型[][]... 数组名称 = new 数据类型[][]...{{...}} / 数据类型 数组名称[][]...= new 数据类型[][]...{{...}}

    public static void main(String[] args) {
        // 动态初始化
        int[] a = new int[3];
        // 动态分步初始化
        int[] b = null;
        b = new int[10];

        // 静态初始化
        // 简化格式
        int[] c = {1,2,3,4,5,6,7,8,9,10};
        // 完整格式
        int[] d = new int[]{1,2,3,4};

        int e[] = {1,2,3,4};
        System.out.println(e.length);

        // 多维数组
        int[][][] f = new int[5][6][7];
        int[][][] g = {{{1,2,3},{4,5,6}},{{7,8,9}},{{10,11,12},{13,14,15}}};
        int h[][][] = new int[][][]{{{1,2,3},{4,5,6}},{{7,8,9}},{{10,11,12},{13,14,15}}};
        System.out.println(11111);
    }

}
